# Задание 1
cat_name = input('Введите имя кота: ')
expenses = input('Введите сколько рублей кот тратит на корм: ')
print(f'Ваш кот {cat_name.capitalize()} очень наглый, он тратит аж {expenses} рублей на корм')

# Задание 2